app/controllers/movies_controller.rb

  def index
#debug(params)
    @all_ratings = Movie.all.map(&:rating).uniq
---
SELECT "movies".* FROM "movies" WHERE "rating"."#<Movie:0xb466bdf4>" = '1' AND "rating"."#<Movie:0xb4619f54>" = '1' AND "rating"."#<Movie:0xb4618f8c>" = '1' AND "rating"."#<Movie:0xb4617ed4>" = '1' AND "rating"."#<Movie:0xb4616e44>" = '1' AND "rating"."#<Movie:0xb4609eec>" = '1' AND "rating"."#<Movie:0xb4609d84>" = '1' AND "rating"."#<Movie:0xb4609c1c>" = '1' AND "rating"."#<Movie:0xb4609ab4>" = '1' AND "rating"."#<Movie:0xb460994c>" = '1'